import sqlite3
reg = ["Республика Адыгея","Республика Башкортостан", "Республика Бурятия","Республика Алтай","Республика Дагестан", "Республика Ингушетия", "Кабардино-Балкарская Республика",
       "Республика Калмыкия", "Карачаево-Черкесская Республика", "Республика Карелия", "Республика Коми", "Республика Марий Эл", "Республика Мордовия", "Республика Саха", "Республика Северная Осетия",
       "Республика Татарстан", "Республика Тыва", "Удмуртская Республика", "Республика Хакасия", "Нет региона", "Чувашская Республика — Чувашия", "Алтайский край","Краснодарский край",
       "Красноярский край","Приморский край","Ставропольский край","Хабаровский край","Амурская область","Архангельская область","Астраханская область", "Белгородская область", "Брянская область",
       "Владимирская область", "Волгоградская область", "Вологодская область", "Воронежская область", "Ивановская область", "Иркутская область", "Калининградская область", "Калужская область","Камчатский край",
       "Кемеровская область — Кузбасс", "Кировская область","Костромская область", "Курганская область", "Курская область", "Ленинградская область", "Липецкая область", "Магаданская область", "Московская область",
       "Мурманская область", "Нижегородская область", "Новгородская область", "Новосибирская область", "Омская область", "Оренбургская область", "Орловская область", "Пензенская область","Пермский край",
       "Псковская область", "Ростовская область", "Рязанская область", "Самарская область", "Саратовская область", "Сахалинская область", "Свердловская область", "Смоленская область", "Тамбовская область",
       "Тверская область", "Томская область", "Тульская область", "Тюменская область", "Ульяновская область", "Челябинская область","Забайкальский край","Ярославская область", "Москва", "Санкт-Петербург",
       "Еврейская автономная область","Автономера Агинского Бурятского автономного округа","Нет региона","Нет региона","Ненецкий АО","Нет региона","Нет региона", "Ханты-Мансийский АО — Югра", "Чукотский АО","Нет региона",
       "Ямало-Ненецкий АО","Нет региона","Республика Крым","Г. Севастополь","Нет региона","Нет региона","Чеченская Республика"]
type = ["Транспортный","Техногенный","Экологический","Социальный"]
class DB:
    def __init__(self,db_file):
        self.conn = sqlite3.connect(db_file)
        self.cursor = self.conn.cursor()


    def add_info(self,type_name,reg_id,text,date):
        print("1")
        type_id = self.cursor.execute("select id from type where name =?",(type_name,)).fetchall()
        type_id = type_id[0][0]
        self.cursor.execute("INSERT INTO INFO (region,type,text,date) VALUES (?,?,?,?)",(reg_id,type_id,text,date,))
        print("2")
        return self.conn.commit()

    def get_id_reg(self,reg):
        a = self.cursor.execute("select id from regions where name = ?",(reg,)).fetchall()
        return a[0][0]

    def add_reg(self,reg):
        self.cursor.execute("INSERT INTO regions (name) VALUES (?)",(reg,)).fetchall()
        return self.conn.commit()

    def add_type(self,type):
        self.cursor.execute("INSERT INTO type (name) VALUES (?)", (type,)).fetchall()
        return self.conn.commit()

    def creat(self):
        self.cursor.execute('''CREATE TABLE regions (
        id   INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT
        );''')

        self.cursor.execute('''CREATE TABLE type (
        id   INTEGER PRIMARY KEY AUTOINCREMENT,
        name TEXT
        );''')

        self.cursor.execute('''CREATE TABLE INFO (
        id     INTEGER PRIMARY KEY AUTOINCREMENT,
        region INTEGER REFERENCES regions (id),
        type   INTEGER REFERENCES type (id),
        text   TEXT,
        date   DATE
        );''')
        for i in reg:
            DB.add_reg(self,i)
        for i in type:
            DB.add_type(self,i)
        return self.conn.commit()